[
    {
      "postText": "What could be the reason for veinal chlrosis",
      "postCreator": "Remin",
      "comments":[
        {"commentText": "The reasons for veinal chlorosis are complicated but generally relate to nutrient deficiencies before anything else. Foliar applications are minimally effective so please explain how and with what you typically fertilize.",
          "commentCreator": "GardenGal48"
        }
      ]
    },
    {
      "postText": "I have a braided money tree about 3 ft tall. Trouble started in the winter, yellowing and falling leaves.The smaller leaves and buds began to shrivel and die at the end of the branches. Now one whole braid is shriveled and brown another is on the way. I have about an 1 inch between the tree and pot.",
      "postCreator": "SunderWunder",
      "comments":[
        {"commentText": "Remove it from that huge container, and put it into a well-draining orchid style mix (fine-grade bark) in a one-gallon pot with drainage holes. Then, put it in your sunniest window, and fertilize two weeks after repotting",
          "commentCreator": "GreenMan39"
        },
        {"commentText": "check the pot - may be overwatering or the plant needs to be repotted.",
          "commentCreator": "Jenny"
        }
      ]
    },
    {
      "postText": "Hello all. My rubber tree is in need of a little trimming. Several of the branches are getting extremely long and the plant is looking somewhat lopsided. If I trim a few of the branches, can I root and directly plant the branch in new soil? Will a new tree start growing? Thanks for the advice!",
      "postCreator": "Johnny",
      "comments":[
        {"commentText": "I've rooted F. elastica cuttings in soil. Sticking them right into the pot with the main plant works sometimes for me but I have the best success putting them in smaller pots and making sure they maintain higher humidity, keep the soil moist but not wet, and give them bright light. Make sure you have some of the stem and not just the leaf petiole. ",
          "commentCreator": "PurpleRainbow"
        }
      ]
    },
    {
      "postText": "What are some plants that are non-toxic to cats and dog?",
      "postCreator": "JosephAltuzarra",
      "comments":[
        {"commentText": "Rattlesnake plants are pet friendly! They thrive when placed away from direct light, in an ideal temperature range of 70–80 degrees F. They’ll need watering when the top of the soil feels dry to the touch; they also enjoy a spritz if their leaves are looking dry. ",
          "commentCreator": "Allen"
        },
        {"commentText": "Here check out this link that provides a list of pet friendly plants.https://www.architecturaldigest.com/story/pet-friendly-houseplants",
          "commentCreator": "Parker"
        }
      ]
    }
]
  